docs/rails/rake/todo/2016/05/07/rake-notes-keep-todos-in-rails-code.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-28 Thu 02:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rake notes - keep your TODOs in the code</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://gongzhitaao.org/orgcss/org.css" type="text/css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.10.0/styles/googlecode.min.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="/about.html">about</a>
</div>
<div id="content">
<h1 class="title">rake notes - keep your TODOs in the code</h1>
<p>
<code>rake notes</code> will search through your code for comments beginning with <code>FIXME</code>, <code>OPTIMIZE</code> or <code>TODO</code>.
The search is done in files with extension <b>.builder</b>, <b>.rb</b>, <b>.rake</b>, <b>.yml</b>, <b>.yaml</b>, <b>.ruby</b>, <b>.css</b>, <b>.js</b> and <b>.erb</b> for both default and custom annotations.
</p>

<div class="org-src-container">
<pre class="src src-bash">$ bin/rake notes
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">in</span> /home/foobar/commandsapp)
app/controllers/admin/users_controller.rb:
  * <span class="org-rainbow-delimiters-depth-2">[</span> 20<span class="org-rainbow-delimiters-depth-2">]</span> <span class="org-rainbow-delimiters-depth-2">[</span>TODO<span class="org-rainbow-delimiters-depth-2">]</span> any other way to do this?
  * <span class="org-rainbow-delimiters-depth-2">[</span>132<span class="org-rainbow-delimiters-depth-2">]</span> <span class="org-rainbow-delimiters-depth-2">[</span>FIXME<span class="org-rainbow-delimiters-depth-2">]</span> high priority for next deploy
app/models/school.rb:
  * <span class="org-rainbow-delimiters-depth-2">[</span> 13<span class="org-rainbow-delimiters-depth-2">]</span> <span class="org-rainbow-delimiters-depth-2">[</span>OPTIMIZE<span class="org-rainbow-delimiters-depth-2">]</span> refactor this code to make it faster
  * <span class="org-rainbow-delimiters-depth-2">[</span> 17<span class="org-rainbow-delimiters-depth-2">]</span> <span class="org-rainbow-delimiters-depth-2">[</span>FIXME<span class="org-rainbow-delimiters-depth-2">]</span>
</pre>
</div>

<p>
<a href="http://guides.rubyonrails.org/command_line.html#notes">&gt;&gt; Continue reading &lt;&lt;</a>
</p>
</div>
<div id="postamble" class="status">
2020
</div>
</body>
</html>
